import os
from shutil import copyfile
import argparse
import shutil
#! imgname='1000_c2s2_125752_07.jpg'
def parse_frame(imgname, dict_cam_seq_max={}):
    dict_cam_seq_max = {
        11: 72681, 12: 74546, 13: 74881, 14: 74661, 15: 74891, 16: 54346, 17: 0, 18: 0,
        21: 163691, 22: 164677, 23: 98102, 24: 0, 25: 0, 26: 0, 27: 0, 28: 0,
        31: 161708, 32: 161769, 33: 104469, 34: 0, 35: 0, 36: 0, 37: 0, 38: 0,
        41: 72107, 42: 72373, 43: 74810, 44: 74541, 45: 74910, 46: 50616, 47: 0, 48: 0,
        51: 161095, 52: 161724, 53: 103487, 54: 0, 55: 0, 56: 0, 57: 0, 58: 0,
        61: 87551, 62: 131268, 63: 95817, 64: 30952, 65: 0, 66: 0, 67: 0, 68: 0}
    fid = imgname.strip().split("_")[0] #! 1000
    cam = int(imgname.strip().split("_")[1][1]) #! c2
    seq = int(imgname.strip().split("_")[1][3]) #! s2
    frame = int(imgname.strip().split("_")[2])  #! 125752
    count = imgname.strip().split("_")[-1]      #! 07.jpg
    # print(id)
    # print(cam)  # 1
    # print(seq)  # 2
    # print(frame)
    re = 0
    for i in range(1, seq):
        re = re + dict_cam_seq_max[int(str(cam) + str(i))] #* 不同摄像机的视频序列和第一个视频序列起始时间的帧 差异
    re = re + frame
    new_name = str(fid) + "_c" + str(cam) + "_f" + '{:0>7}'.format(str(re)) + "_" + count #! {:0>7}7位数，前面补零       '1000_c2_f0163691_07.jpg'
    #* 重命名 print(new_name)
    return new_name

# dict_cam_seq_max = {
#     11: 72681, 12: 74546, 13: 74881, 14: 74661, 15: 74891, 16: 54346, 17: 0, 18: 0,
#     21: 163691, 22: 164677, 23: 98102, 24: 0, 25: 0, 26: 0, 27: 0, 28: 0,
#     31: 161708, 32: 161769, 33: 104469, 34: 0, 35: 0, 36: 0, 37: 0, 38: 0,
#     41: 72107, 42: 72373, 43: 74810, 44: 74541, 45: 74910, 46: 50616, 47: 0, 48: 0,
#     51: 161095, 52: 161724, 53: 103487, 54: 0, 55: 0, 56: 0, 57: 0, 58: 0,
#     61: 87551, 62: 131268, 63: 95817, 64: 30952, 65: 0, 66: 0, 67: 0, 68: 0}